package com.netease.gather.classifier.naivebayes;

import java.util.Arrays;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;

/**
 * User: AzraelX
 * Date: 13-10-12
 * Time: 上午11:14
 */
public class AirKeyWords {

    public static Map<String,List<String>> classwords = new LinkedHashMap<String,List<String>>();

    static {
        List<String> minhangwords = Arrays.asList("南航","东航","东方航空","东航","航企","航空公司","运输航空","海航","厦航","厦门航空","国航",
                "国际航空","全日空","天马航空","阿提哈德航空","阿联酋航空","阿航","维珍航空","澳航","澳洲航空","东海航空","航班","航线","廉价航空",
                "捷星航空","幸福航空","韩亚航空","国泰航空","捷蓝航空","航权","卡塔尔航空","荷兰航空","KLM航空","汉莎航空","春秋航空","香港航空",
                "美国航空","美航","达美航空","全美航空","民营航空","机场","马来西亚航空","法航","西南航空","挪威航空","国泰航空","瑞丽航空","埃航",
                "埃及航空","国际航协","阿根廷航空","越南航空","越航","缅甸航空","新加坡航空","新航","航空经济","土耳其航空","航空货运","值机",
                "干线航空","支线航空","长荣航空","济州航空","酷航","飞鸟航空","山东航空","山航","航空市场","航线","机票","值机","机场","安检",
                "行李托运","机场","航空枢纽","货航","航班","航空餐","飞机餐","航班代码","代码共享","法国航空","吉祥航空","中华航空","瑞安航空",
                "香草航空","空姐","空乘","空少","飞机延误","飞机晚点","航班延误","航班取消","机场关闭","澳洲航空","长龙航空","天西航空","西部航空",
                "乘客斗殴","航空旅游","地方航空","四川航空","祥鹏航空","英国航空","航空市场","高丽航空","航空运输","机票","机票改签","机内娱乐",
                "塔姆航空","空铁联运","客机","民航","空管","运输航空","民用航空","干线飞机","干线客机","支线客机","支线飞机","乘务员","中航信",
                "中航油","中航材","空域管制","头等舱","经济舱","公务舱","候机楼","EASA","空嫂","航班楼");//
        List<String> tongyongwords = Arrays.asList("通用航空","通航","航空医疗","航空救援","S-76","卡32","Ka-32","S-64","S-92",
                "米26","Mi-26","翼装","灭火飞机","消防飞机","灭火直升机","消防直升机","航空护林","通用机场","航拍","空中游览","空中婚礼",
                "直升机婚礼","航空产业园","通航机场","AC-301","AC-311","AC-352","直15","金汇通航","北大荒","首航直升机","东方通航",
                "江苏华宇","华彬天星通航","山东齐翔","新疆通航","云南英安","中信通航","珠海中通","通航产业","低空开放","空域改革","通勤航空",
                "滨奥飞机","DA-40","DA-42","佳宝飞机","通航产业园","通航大会","小型飞机","小飞机","中航通飞","爱飞客","直博会",
                "航模","低空空域","飞行培训","学飞机","黑飞","滑翔伞","动力伞","飞行学院","通用飞机","飞行驾照");
        List<String> gongwuwords = Arrays.asList("公务航空","公务机","BBJ","ACJ","湾流","达索猎鹰","赛斯纳","赛斯纳奖状","赛斯纳野马",
                "赛斯纳君主","日蚀公务机","本田公务机","挑战者","FBO","公务机维修","公务机运营","莱格赛","比奇","豪客","逸华航空","南山航空",
                "汉华航空","U-JET","私人飞机","私人机","私人直升机","G650","猎鹰7X","猎鹰5X","猎鹰2000","G450","G650","VistaJet",
                "Ameco","公务机展","环球5000","商务航空","商务机","皮亚乔","空中国王");
        List<String> fangwuwords = Arrays.asList("战斗机","轰炸机","攻击机","强击机","J-20","J-10","J-11","J-16","J-8","J-7","F-15",
                "F-22","F-35","F-14","F-16","F-4","F-8","F-104","F-105","A-10","B-1","B-52","B-2","TU-22","TU-26","TU-95","TU-160",
                "四代机","五代机","太行发动机","枭龙","昆仑发动机","秦岭发动机","歼八","歼十","歼二十","直十","直二十","Z-10","Z-20","Z-19",
                "Z-8","Z-9","直九","直八","歼20","运二十","Y-20","X-47","X-32","X-31","预警机","运输机","空军","航空兵","空袭","空军",
                "基地","防空导弹","超视距","空空导弹","空对空导弹","近距导弹","无人机","侦察机","U-2","SR-71","SR-72","C-17","阿帕奇",
                "诺格","汉和","NH-90","AW-101","无人战机","无人作战飞机","空中加油","加油机","雷达","吊舱","伙伴加油","电子战","教练机",
                "高教机","初教机","兰德","汉和","简氏","DARPA","T-50","YAK-130","弹道导弹","巡航导弹","轰六","全球鹰","军用","运20","T-50",
                "航母","防空","海军","空军","陆军","陆战队","解放军","武直","军","枪","炮");
        List<String> gongyewords = Arrays.asList("波音","空客","庞巴迪","巴西航空工业","罗尔斯罗伊斯","罗罗","航空发动机","座舱","航电",
                "翼身融合","西科斯基","普惠","赛峰","A320","A330","A340","A350","A380","737","747","757","767","777","787","777X",
                "机翼","起落架","飞机订单","复合材料","两栖飞机","航空工业","苏霍伊","图波列夫","喷气发动机","涡轴发动机","冲压发动机",
                "变循环发动机","涡桨发动机","活塞发动机","SSJ","ARJ","C919","MRJ","E-JET","试飞","首飞","超声速","超音速","中航工业",
                "运12","直9");
        List<String> hangtianwords = Arrays.asList("航天","NASA","火箭","远程导弹","星座","货运飞船","空间站","登月","阿波罗","探月","绕月",
                "战略导弹","洲际导弹","卫星","太空","宇航","欧空局","空天飞机","轨道飞行","行星","小行星","深空","飞船","航天飞机","高超声速",
                "高超音速","纳卫星","皮星","轨道试验","太空篱笆","太空望远镜","空间望远镜","阿斯特里姆","SpaceX","NASA","神舟","嫦娥",
                "长征","远望","高分","烽火","神通","神光");

        //强顺序
        classwords.put("tongyong",tongyongwords);
        classwords.put("gongwu",gongwuwords);
        classwords.put("fangwu",fangwuwords);
        classwords.put("gongye",gongyewords);
        classwords.put("hangtian",hangtianwords);
        classwords.put("minhang",minhangwords);
    }
}
