package com.netease.gather.classifier.naivebayes;

import java.util.Arrays;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;

/**
 * User: AzraelX
 * Date: 13-10-12
 * Time: 上午11:14
 */
public class TravelKeyWords {

    public static Map<String,List<String>> classwords = new LinkedHashMap<String,List<String>>();

    static {
        List<String> meishiwords = Arrays.asList("小吃","夜宵","火锅","烧烤","夜市","烤鸭","甜品","烘培","点心","冰品","冰淇淋","蛋糕","提拉米苏","西餐","日料","美食",
                "食物","餐饮","食讯","菜肴","饭店","米其林","法餐","中餐","地中海风味","香料","调料","葡萄酒","红酒","红葡萄酒","白葡萄酒","香槟","起泡酒","气泡酒","鸡尾酒",
                "粤菜","川菜","养生菜","下午茶","餐厅","舌尖","清酒","咖啡","拉面","美味","饺子");//"成都小吃","精品酒店","奢华酒店","设计酒店""酒店",
        List<String> huwaiwords = Arrays.asList("极限运动","滑雪","漂流","攀岩","登山","攀冰","滑翔伞","事故","驴友","骑行","单车","自行车","潜水","徒步","攀登","马拉松","铁人三项",
                "户外装备","速干裤","冲锋衣","羽绒服","山难","自驾","户外");//,"登山鞋"
        List<String> jingneiwords = Arrays.asList("古镇","水乡","国内","中华","高铁","动车","胡同","江南","廊桥","茶叶","茶文化","皮影戏","川剧","豫剧",
                "秦腔","越剧","粤剧","黄梅戏","昆曲","油菜花","牡丹花","梯田","竹海","客家","苗寨","土楼",
                "直辖市","北京","上海","天津","重庆",
                "华北地区",
                "河北","石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水",
                "山西","太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁",
                "内蒙古","呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善",
                "东北地区",
                "辽宁","沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛",
                "吉林","长春","吉林","四平","辽源","通化","白山","松原","白城","延边",
                "黑龙江","哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭",
                "华东地区",
                "江苏","南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁",
                "浙江","杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水",
                "安徽","合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","巢湖","六安","亳州","池州","宣城",
                "福建","福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德",
                "江西","南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶",
                "山东","济南","青岛","淄博","枣庄","东营","烟台","潍坊","威海","济宁","泰安","日照","莱芜","临沂","德州","聊城","滨州","菏泽",
                "中南地区",
                "河南","郑州","开封","洛阳","平顶山","焦作","鹤壁","新乡","安阳","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店",
                "湖北","武汉","黄石","襄樊","十堰","荆州","宜昌","荆门","鄂州","孝感","黄冈","咸宁","随州","恩施",
                "湖南","长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西",
                "广东","广州","深圳","珠海","汕头","韶关","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮",
                "广西","南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左",
                "海南","海口","三亚",
                "西南地区",
                "四川","成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","宜宾","广安","达州","眉山","雅安","巴中","资阳","阿坝","甘孜","凉山",
                "贵州","贵阳","六盘水","遵义","安顺","铜仁","毕节","黔西南","黔东南","黔南",
                "云南","昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","文山","红河","西双版纳","楚雄","大理","德宏","怒江","迪庆",
                "西藏","拉萨","昌都","山南","日喀则","那曲","阿里","林芝",
                "西北地区",
                "陕西","西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛",
                "甘肃","兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏","甘南","敦煌",
                "青海","西宁","海东","海北","黄南","海南","果洛","玉树","海西",
                "宁夏","银川","石嘴山","吴忠","固原","中卫",
                "新疆","乌鲁木齐","克拉玛依","吐鲁番","哈密","和田","阿克苏","喀什","克孜勒苏柯尔克孜","巴音郭楞蒙古","昌吉","博尔塔拉蒙古","伊犁哈萨克","塔城","阿勒泰",

                "八里河","绩溪龙川","天堂寨","九华山","黄山","皖南古村落","西递宏村","天柱山","奥林匹克公园","恭王府","八达岭长城","颐和园","天坛","故宫","明十三陵","福鼎太姥山",
                "清源山","白水洋","鸳鸯溪","武夷山","鼓浪屿","泰宁","土楼","永定","南靖","崆峒山","嘉峪关","麦积山","西樵山","华侨城","长隆","丹霞山","连州地下河","白云山",
                "雁南飞茶田","观澜湖","独秀峰","王城","乐满地","漓江","百里杜鹃","龙宫","黄果树","分界洲岛","呀诺达","大小洞天","南山","避暑山庄","白洋淀","山海关","西柏坡",
                "野三坡","龙潭大峡谷","云台山","龙门石窟","嵩山","少林","栾川","老君山","鸡冠洞","尧山","中原大佛","殷墟","白云山","清明上河园","汤旺河","林海奇石","太阳岛",
                "镜泊湖","五大连池","东湖","长阳","清江画廊","三峡","黄鹤楼","神农架","神龙溪","纤夫","三峡人家","武当山","武陵源","天门山","南岳","衡山","岳麓山","橘子洲",
                "韶山","岳阳楼","君山岛","长白山","伪满皇宫","净月潭","沙家浜","虞山尚湖","天目湖","太湖","鼋头渚","金山","焦山","北固山","濠河","金鸡湖","环球恐龙城","同里",
                "瘦西湖","夫子庙","秦淮","灵山","周庄","拙政园","虎丘山","留园","三国","水浒","钟山","中山陵园","溱湖","古窑","婺源","井冈山","庐山","龙虎山","三清山","老虎滩",
                "金石滩","成吉思汗陵","响沙湾","沙坡头","沙湖","北堡","塔尔寺","青海湖","天下第一泉","台儿庄","泰山","曲阜","明故城","三孔","蓬莱阁","三仙山","八仙过海","刘公岛",
                "龙口南山","崂山","介休绵山","五台山","云冈石窟","皇城相府","黄帝陵","华清池","兵马俑","大雁塔","大唐芙蓉园","华山","东方明珠","汶川","北川","羌城","阆中",
                "邓小平故里","九寨沟","峨眉山","青城山","都江堰","黄龙","乐山大佛","盘山","古文化街","津门故里","大昭寺","布达拉宫","泽普","金湖杨","富蕴","可可托海","喀纳斯",
                "葡萄沟","天山","天池","那拉提","香格里拉","普拉措","丽江","玉龙雪山","石林","西双版纳","崇圣寺","开化","根宫佛国","鲁迅故里","沈园","东阳","横店","桐乡","乌镇",
                "奉化","溪口","滕头","千岛湖","普陀山","雁荡山","西湖","西溪湿地","南湖","南川","金佛山","神龙峡","黑山谷","桃花源","巫山","大足石刻","武隆","喀斯特",
                "天生三桥","仙女山","芙蓉洞",
                "5A","4A","3A","蒙古族","藏族",
                "维吾尔族","苗族","彝族","壮族","布依族","朝鲜族","满族","侗族","瑶族","白族","土家族","哈尼族","哈萨克族","傣族","黎族","傈僳族","佤族","畲族","高山族","拉祜族",
                "水族","东乡族","纳西族","景颇族","柯尔克孜族","土族","达斡尔族","仫佬族","羌族","布朗族","撒拉族","毛南族","仡佬族","锡伯族","阿昌族","普米族","塔吉克族",
                "怒族","乌孜别克族","俄罗斯族","鄂温克族","德昂族","保安族","裕固族","京族","塔塔尔族","独龙族","鄂伦春族","赫哲族","门巴族","珞巴族","基诺族");
        List<String> chujingwords = Arrays.asList("出境","新马泰","港澳台","香港","澳门","台湾","台北","高雄","基隆","台中","台南","新竹","嘉义","安检","护照","签证","自由行",
                "北极","南极","免税","退税","海购","汇率","国际航班","时差","境外刷卡","普吉岛","巴厘岛","马尔代夫","塞班岛","格陵兰岛","马达加斯加","全球","世界","异国","北海道",
                "大不列颠","爪哇","纽芬兰岛","冰岛","斯里兰卡","火地岛","西西里岛","撒丁岛","斐济",
                "非洲",
                "北非",
                "阿尔及利亚","埃及","利比亚","摩洛哥","苏丹","突尼西亚",
                "西非",
                "贝宁","布吉纳法索","布基纳法索","查德","乍得","科特迪瓦","甘比亚","冈比亚","加纳","几内亚","几内亚比索","赖比瑞亚","利比里亚","马里","尼日","尼日尔","毛里塔尼亚","奈及利亚","尼日利亚","塞内加尔","狮子山","塞拉利昂","多哥","维德角","佛得角",
                "中非",
                "喀麦隆","中非","赤道几内亚","加彭","加蓬","刚果共合国","刚果民主共和国","刚果民主共和国","圣多美普林西比",
                "南非",
                "安哥拉","波札那","博茨瓦纳","葛摩","科摩罗","赖索托","莱索托","马达加斯加","马拉维","模里西斯","毛里求斯","莫桑比克","纳米比亚","史瓦济兰","斯威士兰","南非","坦尚尼亚","赞比亚","津巴布韦",
                "东非",
                "蒲隆地","布隆迪","吉布地","吉布提","厄利垂亚","厄立特里亚","伊索比亚","埃塞俄比亚","肯亚","肯尼亚","卢安达","卢旺达","塞席尔","塞舌尔","索马利亚","索马里","坦桑尼亚","乌干达",
                "美洲",
                "北美",
                "加拿大","墨西哥","美国",
                "中美",
                "贝里斯","伯利兹","哥斯达黎加","萨尔瓦多","危地马拉","洪都拉斯","尼加拉瓜","巴拿马","加勒比",
                "安地卡及巴布达","安提瓜和巴布达","巴哈马","巴贝多","巴巴多斯","古巴","多米尼克","多米尼加联邦","多米尼加","多米尼加共和国","格瑞纳达","格林纳达","海地","牙买加","圣克里斯多福及尼维斯","圣基茨和尼维斯","圣露西亚","圣卢西亚","圣文森及格瑞那丁","圣文森特和格林纳丁斯","千里达及托巴哥","特立尼达和多巴哥",
                "南美",
                "阿根廷","玻利维亚","巴西","智利","哥伦比亚","厄瓜多尔","盖亚那","圭亚那","秘鲁","巴拉圭","苏利南","苏里南","乌拉圭","委内瑞拉",
                "百幕达","百慕大","开曼群岛",
                "南极洲",
                "亚洲",
                "东亚",
                "日本","北韩","朝鲜","韩国",
                "东南亚",
                "缅甸","文莱","柬埔寨","东帝汶","印度尼西亚","寮国","老挝","马来西亚","菲律宾","新加坡","泰国","越南",
                "南亚",
                "孟加拉国","不丹","印度","马尔地夫","尼泊尔","巴基斯坦","斯里兰卡",
                "中亚",
                "哈萨克斯坦","吉尔吉斯斯坦","塔吉克斯坦","土库曼斯坦","乌兹别克斯坦",
                "西亚",
                "阿富汗","亚美尼亚","亚美尼亚","亚塞拜然","阿塞拜疆","巴林","塞浦路斯","塞浦路斯 - 北塞浦路斯","北塞浦路斯","乔治亚","格鲁吉亚","伊朗","伊拉克","以色列","约旦","科威特","黎巴嫩","阿曼","巴勒斯坦","卡达","卡塔尔","沙特阿拉伯","叙利亚","土耳其","阿拉伯联合大公国","阿拉伯联合酋长国","也门",
                "欧洲",
                "西欧",
                "比利时","法国","爱尔兰","卢森堡","摩纳哥","荷兰","英国",
                "北欧",
                "丹麦","芬兰","冰岛","瑞典",
                "中欧",
                "奥地利","捷克","德国","匈牙利","列支敦士登","波兰","斯洛伐克","瑞士",
                "东欧",
                "白俄罗斯","爱沙尼亚","拉脱维亚","立陶宛","摩尔多瓦","俄罗斯","乌克兰",
                "南欧",
                "阿尔巴尼亚","安道尔","波斯尼亚和黑塞哥维那","波黑","保加利亚","克罗地亚","克罗埃西亚","塞浦路斯","希腊","意大利","马其顿","马耳他","葡萄牙","罗马尼亚","圣马利诺","塞尔维亚和黑山","塞尔维亚与蒙特内哥罗","斯洛文尼亚","西班牙","梵蒂冈","教廷",
                "直布罗陀","根西岛","泽西",
                "大洋洲",
                "澳大利亚","斐济","吉里巴斯","马绍尔群岛","密克罗尼西亚","瑙鲁","诺鲁","新西兰","帕劳","帛琉","巴布亚新几内亚","萨摩亚","萨摩亚","所罗门群岛","索罗门群岛","东加","图瓦卢","瓦努阿图","万那杜",
                "萨摩亚","圣诞岛","关岛","中途岛","纽埃","塞班岛");

        //强顺序
        classwords.put("meishi",meishiwords);
        classwords.put("huwai",huwaiwords);
        classwords.put("chujing",chujingwords);
        classwords.put("jingnei",jingneiwords);
    }
}
